{
  "Bodywork": [
    {
      "id": 1,
      "icon": "/icons/body-repair.svg",
      "title": "Bodywork Repairs",
      "text": "We specialise in repairing major body damage after accidents, restoring your vehicle's structural integrity and appearance with expert craftsmanship."
    },
    {
      "id": 2,
      "icon": "/icons/welding.svg",
      "title": "Rust Panel Replacement & Welding",
      "text": "Extend the life of your vehicle with our rust panel replacement and welding services. We remove corroded sections and restore them to their original condition."
    },
    {
      "id": 3,
      "icon": "/icons/paint-repair.svg",
      "title": "Minor Paintwork Repairs",
      "text": "From scratches to small dents, our minor paintwork repair services ensure your car maintains a flawless and polished appearance."
    },
    {
      "id": 4,
      "icon": "/icons/polishing.svg",
      "title": "Car Polishing & Detailing",
      "text": "Enhance the shine and protection of your vehicle with our professional car polishing and detailing services. We bring back that showroom finish!"
    },
    {
      "id": 5,
      "icon": "/icons/pdr.svg",
      "title": "Paintless Dent Removal (PDR)",
      "text": "Remove minor dents and dings without repainting, preserving your car’s original finish using specialised PDR techniques."
    },
    {
      "id": 6,
      "icon": "/icons/headlight.svg",
      "title": "Headlight Restoration",
      "text": "Improve nighttime visibility and refresh your car’s look with our headlight restoration services. Say goodbye to cloudy or faded lenses."
    },
    {
      "id": 7,
      "icon": "/icons/glass-repair.svg",
      "title": "Car Glass Repairs",
      "text": "Repair chips and cracks in your vehicle’s glass before they spread. Our glass repair service ensures safety and clarity."
    }
  ],
  "Mechanical Services": [
    {
      "id": 8,
      "icon": "/icons/oil-change.svg",
      "title": "Oil & Filter Changes",
      "text": "Keep your engine running smoothly with regular oil and filter changes, ensuring longevity and performance."
    },
    {
      "id": 9,
      "icon": "/icons/brake-repair.svg",
      "title": "Brake System Repairs",
      "text": "Ensure your safety on the road with our comprehensive brake repair services, from pad replacements to full system overhauls."
    },
    {
      "id": 10,
      "icon": "/icons/exhaust.svg",
      "title": "Exhaust System Repairs",
      "text": "Fix leaks, enhance performance, and reduce emissions with our expert exhaust system repair services."
    },
    {
      "id": 11,
      "icon": "/icons/suspension.svg",
      "title": "Suspension Repairs",
      "text": "Maintain a smooth and stable ride with our suspension repair services, including shock and strut replacements."
    },
    {
      "id": 12,
      "icon": "/icons/lock-repair.svg",
      "title": "Door Lock & Window Regulator Repairs",
      "text": "Fix malfunctioning locks and window regulators to ensure security and convenience in your vehicle."
    }
  ]
}
